
public class Exercise6_6 {
/*
[6-13] 다음 중 아래의 add메서드를 올바르게 오버로딩 한 것은? (모두 고르시오) (b,c,d)
long add(int a, int b) { return a+b;}
a. long add(int x, int y) { return x+y;}
b. long add(long a, long b) { return a+b;}
c. int add(byte a, byte b) { return a+b;}
d. int add(long a, int b) { return (int)(a+b);}

[6-14] 다음 중 초기화에 대한 설명으로 옳지 않은 것은? (모두 고르시오) (c,e)
a.멤버변수는 자동 초기화되므로 초기화하지 않고도 값을 참조할 수 있다.
b.지역변수는 사용하기 전에 반드시 초기화해야 한다.
c.초기화 블럭보다 생성자가 먼저 수행된다.
d.명시적 초기화를 제일 우선적으로 고려해야 한다.
e.클래스변수보다 인스턴스변수가 먼저 초기화된다.

[6-15] 다음중 인스턴스변수의 초기화 순서가 올바른 것은? (a)
a. 기본값-명시적초기화-초기화블럭-생성자
b. 기본값-명시적초기화-생성자-초기화블럭
c. 기본값-초기화블럭-명시적초기화-생성자
d. 기본값-초기화블럭-생성자-명시적초기화

[6-16] 다음 중 지역변수에 대한 설명으로 옳지 않은 것은? (모두 고르시오) (a,e)
a. 자동 초기화되므로 별도의 초기화가 필요없다.
b. 지역변수가 선언된 메서드가 종료되면 지역변수도 함께 소멸된다.
c. 매서드의 매개변수로 선언된 변수도 지역변수이다.
d. 클래스변수나 인스턴스변수보다 메모리 부담이 적다.
e. 힙(heap)영역에 생성되며 가비지 컬렉터에 의해 소멸된다.

[6-17] 호출스택이 다음과 같은 상황일 때 옳지 않은 설명은? (모두 고르시오) (b)
	println
	method1
	method2
	main
a. 제일 먼저 호출스택에 저장된 것은 main메서드이다.
b. println메서드를 제외한 나머지 메서드들은 모두 종료된 상태이다.
c. method2메서드를 호출한 것은 main메서드이다.
d. println메서드가 종료되면 method1메서드가 수행을 재개한다.
e. main-method2-method1-println의 순서로 호출되었다.
f. 현재 실행중인 메서드는 println 뿐이다.
  */
}
